* Worktime
| Start |   End | Hours | Delta |  Saldo |
|-------+-------+-------+-------+--------|
| 06:00 | 00:30 | 07:42 |       |  10:00 |
| 08:00 | 10:00 | 02:00 | 05:42 |  04:18 |
| 08:00 | 10:00 | 02:00 | 05:42 | -01:24 |
| 08:00 | 10:00 | 02:00 | 05:42 | -07:06 |
| 08:00 | 10:00 | 02:00 | 05:42 | -12:48 |
| 08:00 | 10:00 | 02:00 | 05:42 | -18:30 |
| 08:00 | 10:00 | 02:00 | 05:42 | -24:12 |
| 08:00 | 10:00 | 02:00 | 05:42 | -29:54 |
| 08:00 | 10:00 | 02:00 | 05:42 | -35:36 |
#+TBLFM: @3$3..@10$3='(if (>= (- $2 $1) @2$1) (- (- $2 $1) @2$2) (- $2 $1));U::@3$4..@10$4='(if (>= $3 @2$3) (- $3 @2$3) (- @2$3 $3));U::@3$5..@10$5='(if (>= $3 @2$3) (+ (- $3 @2$3) @-1) (- @-1 (- @2$3 $3)));U
